# -*- coding: utf-8 -*-
"""дз_№1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1nPRsIcBOXkbpaJfYqKMvKJ2V0z2nO1z5

# Python для анализа данных

## Введение в Python

### Задача 1

Считайте с входящей строки два целых числа и выведите их произведение. Если произведение больше 1000, то дополнительно выведите сумму чисел.
"""

print('Введите первое число :')
x=int(input())
print('Введите второей число :')
y=int(input())
proiz = x * y
if x*y < 1000:
    print('Произведение равно - ', proiz)
else:
    summa = x+y
    print('Произведение равно - ', proiz,  'Сумма равна - ', summa)

"""### Задача 2

Дан ряд целых чисел от 5 до 12 включительно. Используя цикл for выведите на экран сумму двух последовательно идущих чисел.


**Пример**: 

Для ряда от 2 до 6 включительно выдача выглядит так: 

5

7

9

11
"""

summa = 0
for i in range(6, 13):
    summa = (i+(i-1))
    print(summa)
    print()

"""### Еще один как вариант можно сделать"""

summa = 0
summa = [(i+(i-1)) for i in range(6, 13)]
print(summa)

"""### Задача 3

Для ряда целых чисел от 10 до 20 включительно выведите на экран только те, что делятся на 2 без остатка.
"""

for i in range(10,21):
    x = i%2
    if x == 0:
        print(i)

"""### Задача 4

Считайте с входящей строки целое положительное число и сохраните его в переменную N. Используя кострукцию if...else выведите на экран результат в зависимости от условий:

* Если N нечетное, то выведите на экран "N нечетное"
* Если N четное и входит в интервал от 5 до 10 включительно, выведите на экран "N четное и принадлежит интервалу [5, 10]"
* Если N четное и больше 10, выведите на экран "N четное и N > 10"
* Если N четное и меньше 5, выведите на экран "N четное и N < 5"
"""

print('Введите положительное число')
N = int(input())
if N >= 0:
    if N%2 != 0:
        print(N, "нечетное")
    else:
        if N>5 and N<=10:
            print(N, "четное и принадлежит интервалу [5, 10]")
        elif N>10:
            print(N,'четное и', N, '> 10')
        elif N < 5:
            print(N, 'четное и', N,'< 5' )
             
else:
    print('Вы ввели отрицательное число')

"""### Задача 5

Используя цикл while, посчитайте и выведите на экран сумму всех целых чисел от 2 до 7 включительно.
"""

i=2
s=0
while i<=7:
    s=i+s
    i=i+1
print('Сумма целых чисел от 2 до 7 включительно равна ',s)

"""## Pro версия

### Задача 1

Выведите на экран следующий паттерн:

1

2 2 

3 3 3 

4 4 4 4 

5 5 5 5 5

Обратите внимание на пробел между символами
"""

for num in range(6):
    for i in range(num):
        print (num, end=" ") 
    print("\n")

"""### Задача 2

Выведите на экран следующий паттерн:

1

2 2 

3 3 3 

4 4 4 4 

5 5 5 5 5

6 6 6 6

7 7 7

8 8

9

Обратите внимание на пробел между символами
"""

for num in range(6):
        for i in range(num):
            print (num, end=" ") 
        print("\n")
x = 6
    for y in range (x):
        for j in range(1, 5-y):
            print(x, end = ' ')
        print("\n")
        x = x + 1

"""### Задача 3

Используя цикл while, выведите на экран таблицу умножения для числа 6.

**Пример:**
    
Для числе 5 выдача выглядит так:
    
5 * 1 = 5

5 * 2 = 10

5 * 3 = 15

5 * 4 = 20

5 * 5 = 25

...

5 * 9 = 45
"""

i=1
s=0
while i<=9:
    s=i*6
    print('6 *',i,'=',s)
    i = i +1

"""### Задача 4

Представьте, что вы подбрасываете два кубика одновременно. Считайте с входящей строки два целых числа d1 и d2. Проверьте, соответсуют ли введенные числа интервалу значений для кубика. Если нет, то выведите на экран строку "Ошибка! Значение на кубике (1 или 2, вставьте подходящее значение) не входит в интервал [1, 6]". В противном случае посчитайте сумму выпавших значений. Если сумма равна 7 или 11, выведите на экран "Я победил!!!". Если сумма равна 2, 3 или 12, то выведите на экран "Я проиграл :(". Во всех остальных случаях выведите на экран сумму значений.
"""

import random
d1=random.randint(0, 6)
d2=random.randint(0, 6)
if d1 == 0 and d1 == 0:
    print('Ошибка! Значения на кубике не входит в интервал [1, 6]')
    print("Первый кубик равен : ", d1)
    print("Второй кубик равен : ", d2)
else:
    suma = d1 + d2
    if suma == 7 or suma == 11:
        print('Я победил!!!', suma)
    elif suma == 2 or suma == 3 or suma == 12:
        print("Я проиграл :(", suma)
    else:
        print("Сумма выпавшего значения равна : ", suma)

"""### Задача 5

Напишите код, который ищет все числа в интервале от 2000 до 3200 включительно, делящиеся на 7, но не делящиеся на 5. Выведите на экран все найденные числа.
"""

for i in range(2000, 3201):
    if i%7==0 and i%5!=0:
        print(i)